[
    {
        "id": 1,
        "name": "Miss Sathi",
        "description": "Chef Miss Sathi is a popular Bangladeshi chef who has gained fame for his culinary skills and innovative dishes. She was born in Dhaka, Bangladesh, and started her culinary career in her early twenties. Chef Ali has worked in various renowned restaurants in Bangladesh, including the Pan Pacific Sonargaon Hotel, and has also served as a chef consultant for several international hotels.",
        "photo": "https://i.ibb.co/QDb1gCV/istockphoto-1142230160-612x612.jpg",
        "like": 1200,
        "years_experience": 10,
        "recipes": [
            {
              "name": "Biriyani",
              "ingredients": [
                "Basmati rice",
                "Chicken",
                "Onion",
                "Garlic paste",
                "Ginger paste",
                "Tomatoes",
                "Yogurt",
                "Spices",
                "Oil",
                "Salt",
                "Water"
              ],
              "method": [
                "Wash the rice in cold water until the water runs clear. Soak the rice in water for 30 minutes.",
                "In a pot, add the rice and enough water to cover it by about an inch. Bring it to a boil over high heat, then reduce the heat to low and let it simmer until the rice is cooked through, about 10-12 minutes. Drain the rice and set it aside.",
                "In a large pot, heat some oil over medium-high heat. Add the sliced onions and cook until they are golden brown, stirring frequently.",
                "Add the garlic and ginger paste to the pot and cook for another minute, stirring constantly.",
                "Add the chicken to the pot and cook until it is browned on all sides.",
                "Add the chopped tomatoes, spices, and yogurt to the pot. Stir well to combine.",
                "Add enough water to the pot to cover the chicken by about an inch. Bring it to a boil over high heat, then reduce the heat to medium-low and let it simmer until the chicken is cooked through, about 25-30 minutes.",
                "Preheat the oven to 350°F (175°C).",
                "In a baking dish, spread a layer of rice on the bottom. Add a layer of chicken on top of the rice. Repeat until all the rice and chicken are used up, ending with a layer of rice on top.",
                "Cover the baking dish with foil and bake for 15-20 minutes, until the rice is heated through and the flavors have melded together.",
                "Serve hot with raita (a yogurt-based sauce) and your favorite side dishes."
              ],
              "rating": 4.5,
              "favorite": false
            },
            {
              "name": "Tarka Dal",
              "ingredients": [
                "Red lentils",
                "Onion",
                "Garlic",
                "Ginger",
                "Turmeric",
                "Cumin",
                "Oil",
                "Salt"
              ],
              "method": [
                "Rinse the lentils thoroughly and soak them in water for 30 minutes. Drain the water and set the lentils aside.",
                "In a pot, add the lentils and enough water to cover them by about an inch. Bring it to a boil over high heat, then reduce the heat to medium-low and let it simmer until the lentils are soft and mushy, about 20-25 minutes. Mash the lentils with a spoon or a whisk.",
                "In a pan, heat some oil over medium heat. Add the sliced onions and cook until they are golden brown, stirring frequently.",
                "Add the garlic and ginger paste to the pan and cook for 1-2 minutes, or until fragrant.",
                "Add the turmeric and cumin to the pan and cook for another minute, stirring constantly.",
                "Add the cooked lentils to the pan and mix well. Add salt to taste.",
                "In a separate pan, heat some more oil over high heat. Once hot, add some cumin seeds and let them sizzle for a few seconds. Pour this seasoned oil, known as tarka, over the dal and mix well.",
                "Serve hot with rice or bread."
              ],
              "rating": 4.5,
              "favorite": false
            },
            {
              "name": "Chitoi Pitha",
              "ingredients": [
                "2 cups Rice flour",
                "2 cups Water",
                "1/2 tsp Salt",
                "1/2 cup Coconut milk",
                "1/4 cup Sugar",
                "1/4 tsp Baking powder",
                "Oil or ghee, for frying"
              ],
              "method": [
                "In a large mixing bowl, combine the rice flour, salt, and baking powder.",
                "In a separate bowl, mix together the water, coconut milk, and sugar until well combined.",
                "Gradually add the liquid mixture to the dry mixture, stirring constantly, until you have a smooth batter.",
                "Cover the bowl and let the batter rest for 1-2 hours at room temperature.",
                "When you're ready to cook the pitha, heat a non-stick pan or tawa over medium heat and lightly grease it with oil or ghee.",
                "Pour a ladleful of the batter onto the pan and spread it evenly to form a circle.",
                "Cover the pan with a lid and let the pitha cook for 2-3 minutes until the surface is dry and the edges start to curl up.",
                "Using a spatula, carefully flip the pitha over and cook for another 1-2 minutes on the other side until lightly browned.",
                "Repeat with the remaining batter, greasing the pan lightly as needed.",
                "Serve hot with your choice of sweet or savory toppings."
              ],
              "rating": 4.8,
              "favorite": true
            },
            {
              "name": "Khichuri Biryani",
              "ingredients": [
                "Basmati rice, washed and soaked for 30 minutes",
                "Water",
                "Salt",
                "Ghee or oil",
                "Bay leaves",
                "Green cardamom pods"
              ],
              "method": [
                "In a large pot, bring the water to a boil over high heat. Add the soaked rice and salt, and stir to combine. Reduce the heat to low, cover the pot, and cook for 10-12 minutes or until the rice is almost done.",
                "In a separate pot, heat the ghee or oil over medium heat. Add the bay leaves, cardamom pods, cloves, and cinnamon stick, and fry for 1-2 minutes until fragrant.",
                "Add the sliced onion and fry for 5-7 minutes until golden brown. Add the ginger paste and garlic paste, and fry for another minute.",
                "Add the red chili powder, turmeric powder, cumin powder, coriander powder, nutmeg powder, and mace powder, and fry for 1-2 minutes.",
                "Add the marinated meat and fry for 5-7 minutes until the meat is browned.",
                "Add the cooked rice to the pot with the meat, and spread it out evenly.",
                "In a small bowl, mix together the milk and saffron strands. Pour the mixture over the rice.",
                "Cover the pot with a tight-fitting lid and seal with dough. Cook over low heat for 30-40 minutes, or until the rice is fully cooked and the meat is tender."
              ],
              "rating": 4.8,
              "favorite": true
            },
            {
              "name": "Mishti Doi",
              "ingredients": [
                "Milk",
                "Plain yogurt",
                "Sugar",
                "Cardamom pods",
                "Saffron (optional)"
              ],
              "method": [
                "In a heavy-bottomed pot, heat the milk over medium-low heat. Stir occasionally to prevent the milk from scorching.",
                "Add the sugar and cardamom pods, and continue to cook the milk until it reduces to half the original quantity. This will take around 30-40 minutes. Remove from heat and let it cool to room temperature.",
                "In a separate bowl, whisk together the plain yogurt and a small amount of the cooled sweetened milk to temper it.",
                "Add the tempered yogurt to the rest of the sweetened milk, and stir well to combine.",
                "Pour the mixture into earthen pots, and cover them with a lid or plastic wrap.",
                "Place the pots in a warm place, like an oven with the light on or in a warm spot in the kitchen. Let the yogurt set for 6-8 hours or until it thickens.",
                "Once the yogurt is set, transfer the pots to the refrigerator to chill for at least 1-2 hours before serving.",
                "If desired, garnish with a few strands of saffron before serving."
              ],
              "rating": 4.2,
              "favorite": false
            }
          ]
    },
    {
        "id": 2,
        "name": "Mr. Limon islam",
        "description": "Chef Mr. Limon islam is a popular Bangladeshi chef who has gained fame for his culinary skills and innovative dishes. he was born in Dhaka, Bangladesh, and started her culinary career in his early twenties. Chef Ali has worked in various renowned restaurants in Bangladesh, including the Pan Pacific Sonargaon Hotel, and has also served as a chef consultant for several international hotels.",
        "photo": "https://i.ibb.co/kq1CZH5/istockphoto-951132442-612x612.jpg",
        "like": 2500,
        "years_experience": 25,
        "recipes": [
            {
              "name": "Fuska",
              "ingredients": [
                "Fuska shells",
                "Boiled potatoes",
                "Chickpeas",
                "Onion",
                "Green chili",
                "Tamarind paste",
                "Cumin powder",
                "Coriander powder",
                "Chaat masala",
                "Salt",
                "Oil"
              ],
              "method": [
                "Boil the potatoes until they are soft, then peel and mash them.",
                "In a mixing bowl, add the mashed potatoes, boiled chickpeas, finely chopped onion, green chili, cumin powder, coriander powder, chaat masala, and salt. Mix well to combine.",
                "Take a fuska shell and make a small hole in the center. Stuff the shell with the potato and chickpea mixture.",
                "Top with a drizzle of tamarind chutney and green chili sauce.",
                "Serve immediately."
              ],
              "rating": 4.8,
              "favorite": true
            },
            {
              "name": "Alu Bhorta",
              "ingredients": [
                "Potatoes",
                "Onion",
                "Green chili",
                "Mustard oil",
                "Salt",
                "Cilantro (optional)"
              ],
              "method": [
                "Boil the potatoes until they are soft, then peel and mash them.",
                "Add finely chopped onion, green chili, mustard oil, and salt to the mashed potatoes. Mix well to combine.",
                "If desired, add chopped cilantro for a fresh herb flavor.",
                "Serve as a side dish with rice or bread."
              ],
              "rating": 4.5,
              "favorite": false
            },
            {
              "name": "Begun Bhorta",
              "ingredients": [
                "Eggplant",
                "Onion",
                "Green chili",
                "Garlic",
                "Mustard oil",
                "Salt",
                "Cilantro (optional)"
              ],
              "method": [
                "Roast the eggplant on an open flame or in the oven until the skin is charred and the flesh is soft.",
                "Peel the charred skin off the eggplant and place the flesh in a mixing bowl.",
                "Add finely chopped onion, green chili, garlic, mustard oil, and salt to the eggplant flesh. Mash and mix well to combine.",
                "If desired, add chopped cilantro for a fresh herb flavor.",
                "Serve as a side dish with rice or bread."
              ],
              "rating": 4.8,
              "favorite": true
            },
            {
              "name": "Lau Chingri",
              "ingredients": [
                "Bottle gourd",
                "Shrimp",
                "Onion",
                "Garlic",
                "Tomatoes",
                "Spices",
                "Oil"
              ],
              "method": [
                "Peel and chop the bottle gourd into small pieces. Clean the shrimp and set aside.",
                "Heat oil in a pan and fry sliced onions until golden brown.",
                "Add chopped garlic and fry until fragrant.",
                "Add chopped tomatoes and cook until they break down into a sauce.",
                "Add turmeric, cumin, coriander, red chili powder, and salt to taste.",
                "Add the bottle gourd and shrimp to the pan and cook until the vegetables are tender and the shrimp is cooked through.",
                "Serve hot with rice or bread."
              ],
              "rating": 4.6,
              "favorite": true
            }
        ]
    },
    {
        "id": 3,
        "name": "Miss Bobita Roy",
        "description": "Chef Miss Bobita Roy is a popular Bangladeshi chef who has gained fame for his culinary skills and innovative dishes. She was born in Dhaka, Bangladesh, and started her culinary career in her early twenties. Chef Ali has worked in various renowned restaurants in Bangladesh, including the Pan Pacific Sonargaon Hotel, and has also served as a chef consultant for several international hotels.",
        "photo": "https://i.ibb.co/0GfcbGw/front-view-young-female-cook-white-cook-suit-white-cap-smiling-happy-140725-15367.jpg",
        "like": 800,
        "years_experience": 20,
        "recipes": [
            {
              "name": "Lal Shak bhaja",
              "ingredients": [
                "2 large ripe tomatoes, sliced",
                "8 oz fresh mozzarella cheese, sliced",
                "1/4 cup fresh basil leaves",
                "2 tbsp extra-virgin olive oil",
                "2 tbsp balsamic vinegar",
                "Salt and pepper, to taste"
              ],
              "method": [
                "Arrange the sliced tomatoes and mozzarella cheese on a large platter.",
                "Scatter the fresh basil leaves over the top.",
                "In a small bowl, whisk together the olive oil, balsamic vinegar, salt, and pepper.",
                "Drizzle the dressing over the salad and serve immediately."
              ],
              "rating": 4.9,
              "favorite": true
            },
            {
              "name": "Bhuna Khichuri",
              "ingredients": [
                "Rice",
                "Red lentils",
                "Onion",
                "Garlic",
                "Ginger",
                "Spices",
                "Salt",
                "Oil",
                "Ghee"
              ],
              "method": [
                "Soak rice and lentils in cold water.",
                "Heat oil and ghee, add spices and fry.",
                "Add sliced onions and fry until golden.",
                "Add garlic and ginger and fry until fragrant.",
                "Add spices, rice, and lentils and fry.",
                "Add water, bay leaf, and cinnamon.",
                "Cover and cook until rice and lentils are done.",
                "Serve hot with fried eggplants, potatoes, or fried fish."
              ],
              "rating": 4.7,
              "favorite": false
            },
            {
              "name": "Polao",
              "ingredients": [
                "Basmati rice",
                "Vegetable oil",
                "Onion",
                "Garlic",
                "Ginger",
                "Cumin seeds",
                "Bay leaf",
                "Carrots",
                "Peas",
                "Salt"
              ],
              "method": [
                "Wash and soak rice for 20 minutes.",
                "Heat oil in a pot and add whole spices.",
                "Add sliced onions and fry until golden brown.",
                "Add garlic and ginger and fry for a minute.",
                "Add rice and fry until it turns translucent.",
                "Add water, salt, and vegetables.",
                "Bring to a boil, then reduce heat to low and cover.",
                "Cook until rice is tender and water is absorbed.",
                "Fluff the rice with a fork and let it rest for a few minutes.",
                "Serve hot with your favorite meat or vegetable dish."
              ],
              "rating": 4.8,
              "favorite": true
            },
            {
              "name": "Ilish Bhaja",
              "ingredients": [
                "Hilsa fish",
                "Turmeric powder",
                "Salt",
                "Mustard oil",
                "Green chilies",
                "Lemon"
              ],
              "method": [
                "Clean and wash the Hilsa fish thoroughly.",
                "Marinate the fish with turmeric powder and salt for 15-20 minutes.",
                "Heat mustard oil in a frying pan over medium-high heat.",
                "Add the marinated fish to the hot oil and fry until it becomes golden brown on both sides.",
                "Remove the fish from the pan and place it on a paper towel to absorb excess oil.",
                "Garnish with sliced green chilies and lemon wedges.",
                "Serve hot with steamed rice and dal."
              ],
              "rating": 4.8,
              "favorite": true
            },
            {
              "name": "Rui Bhaja",
              "ingredients": [
                "Rohu fish",
                "Turmeric powder",
                "Salt",
                "Mustard oil",
                "Green chilies",
                "Lemon"
              ],
              "method": [
                "Clean and wash the Rohu fish thoroughly.",
                "Marinate the fish with turmeric powder and salt for 15-20 minutes.",
                "Heat mustard oil in a frying pan over medium-high heat.",
                "Add the marinated fish to the hot oil and fry until it becomes golden brown on both sides.",
                "Remove the fish from the pan and place it on a paper towel to absorb excess oil.",
                "Garnish with sliced green chilies and lemon wedges.",
                "Serve hot with steamed rice and dal."
              ],
              "rating": 4.8,
              "favorite": true
            }
        ]
    }, 
    {
        "id": 4,
        "name": "Mr Firoj Ahmed",
        "description": "Chef Mr Firoj Ahmed is a popular Bangladeshi chef who has gained fame for his culinary skills and innovative dishes. he was born in Dhaka, Bangladesh, and started his culinary career in his early twenties. Chef Ali has worked in various renowned restaurants in Bangladesh, including the Pan Pacific Sonargaon Hotel, and has also served as a chef consultant for several international hotels",
        "photo": "https://i.ibb.co/y6LgsT6/portrait-smiling-chef-uniform-329181-675.jpg",
        "like": 1800,
        "years_experience": 23,
        "recipes": [
            {
              "name": "Lassi",
              "ingredients": [
                "Plain yogurt",
                "Milk",
                "Sugar",
                "Cardamom powder",
                "Ice cubes"
              ],
              "method": [
                "In a blender, add the plain yogurt, milk, sugar, and cardamom powder.",
                "Blend the ingredients until smooth.",
                "Add a few ice cubes and blend again until the mixture is frothy.",
                "Pour the Lassi into glasses and serve chilled.",
                "Garnish with a sprinkle of cardamom powder and sliced almonds, if desired."
              ],
              "rating": 4.5,
              "favorite": false
            },
            {
              "name": "Bhapa pitha",
              "ingredients": [
                "Rice flour",
                "Jaggery",
                "Coconut milk",
                "Water",
                "Salt",
                "Cardamom powder",
                "Shredded coconut (optional)"
              ],
              "method": [
                "In a mixing bowl, combine the rice flour, jaggery, coconut milk, water, salt, and cardamom powder.",
                "Mix the ingredients well to form a smooth batter. The batter should be thick yet pourable.",
                "Grease a shallow heat-proof dish or a steel container with oil.",
                "Pour the batter into the greased dish and sprinkle some shredded coconut on top.",
                "Cover the dish with aluminum foil or a tight-fitting lid.",
                "Place the dish in a steamer and steam for 20-25 minutes or until a toothpick inserted in the center comes out clean.",
                "Remove the dish from the steamer and let it cool down for a few minutes.",
                "Cut the Bhapa Pitha into pieces and serve warm."
              ],
              "rating": 4.8,
              "favorite": true
            },
            {
              "name": "Rui Bhaja",
              "ingredients": [
                "Rohu fish",
                "Turmeric powder",
                "Salt",
                "Mustard oil",
                "Green chilies",
                "Lemon"
              ],
              "method": [
                "Clean and wash the Rohu fish thoroughly.",
                "Marinate the fish with turmeric powder and salt for 15-20 minutes.",
                "Heat mustard oil in a frying pan over medium-high heat.",
                "Add the marinated fish to the hot oil and fry until it becomes golden brown on both sides.",
                "Remove the fish from the pan and place it on a paper towel to absorb excess oil.",
                "Garnish with sliced green chilies and lemon wedges.",
                "Serve hot with steamed rice and dal."
              ],
              "rating": 4.8,
              "favorite": true
            },
            {
              "name": "Bhapa pitha",
              "ingredients": [
                "Rice flour",
                "Jaggery",
                "Coconut milk",
                "Water",
                "Salt",
                "Cardamom powder",
                "Shredded coconut (optional)"
              ],
              "method": [
                "In a mixing bowl, combine the rice flour, jaggery, coconut milk, water, salt, and cardamom powder.",
                "Mix the ingredients well to form a smooth batter. The batter should be thick yet pourable.",
                "Grease a shallow heat-proof dish or a steel container with oil.",
                "Pour the batter into the greased dish and sprinkle some shredded coconut on top.",
                "Cover the dish with aluminum foil or a tight-fitting lid.",
                "Place the dish in a steamer and steam for 20-25 minutes or until a toothpick inserted in the center comes out clean.",
                "Remove the dish from the steamer and let it cool down for a few minutes.",
                "Cut the Bhapa Pitha into pieces and serve warm."
              ],
              "rating": 4.8,
              "favorite": true
            }
        ]
    }, 
    {
        "id": 5,
        "name": "Miss Labonno Islam",
        "description": "Chef Miss Labonno Islam is a popular Bangladeshi chef who has gained fame for her culinary skills and innovative dishes. she was born in Dhaka, Bangladesh, and started his culinary career in her early twenties. Chef Ali has worked in various renowned restaurants in Bangladesh, including the Pan Pacific Sonargaon Hotel, and has also served as a chef consultant for several international hotels.",
        "photo": "https://i.ibb.co/bJdVVRB/portrait-young-woman-chef-background-488220-23689.jpg",
        "like": 400,
        "years_experience": 13,
        "recipes": [
          {
            "name": "Bhapa pitha",
            "ingredients": [
              "Rice flour",
              "Jaggery",
              "Coconut milk",
              "Water",
              "Salt",
              "Cardamom powder",
              "Shredded coconut (optional)"
            ],
            "method": [
              "In a mixing bowl, combine the rice flour, jaggery, coconut milk, water, salt, and cardamom powder.",
              "Mix the ingredients well to form a smooth batter. The batter should be thick yet pourable.",
              "Grease a shallow heat-proof dish or a steel container with oil.",
              "Pour the batter into the greased dish and sprinkle some shredded coconut on top.",
              "Cover the dish with aluminum foil or a tight-fitting lid.",
              "Place the dish in a steamer and steam for 20-25 minutes or until a toothpick inserted in the center comes out clean.",
              "Remove the dish from the steamer and let it cool down for a few minutes.",
              "Cut the Bhapa Pitha into pieces and serve warm."
            ],
            "rating": 4.8,
            "favorite": true
          },
          {
            "name": "Rui Bhaja",
            "ingredients": [
              "Rohu fish",
              "Turmeric powder",
              "Salt",
              "Mustard oil",
              "Green chilies",
              "Lemon"
            ],
            "method": [
              "Clean and wash the Rohu fish thoroughly.",
              "Marinate the fish with turmeric powder and salt for 15-20 minutes.",
              "Heat mustard oil in a frying pan over medium-high heat.",
              "Add the marinated fish to the hot oil and fry until it becomes golden brown on both sides.",
              "Remove the fish from the pan and place it on a paper towel to absorb excess oil.",
              "Garnish with sliced green chilies and lemon wedges.",
              "Serve hot with steamed rice and dal."
            ],
            "rating": 4.8,
            "favorite": true
          },
            {
              "name": "Bhapa pitha",
              "ingredients": [
                "Rice flour",
                "Jaggery",
                "Coconut milk",
                "Water",
                "Salt",
                "Cardamom powder",
                "Shredded coconut (optional)"
              ],
              "method": [
                "In a mixing bowl, combine the rice flour, jaggery, coconut milk, water, salt, and cardamom powder.",
                "Mix the ingredients well to form a smooth batter. The batter should be thick yet pourable.",
                "Grease a shallow heat-proof dish or a steel container with oil.",
                "Pour the batter into the greased dish and sprinkle some shredded coconut on top.",
                "Cover the dish with aluminum foil or a tight-fitting lid.",
                "Place the dish in a steamer and steam for 20-25 minutes or until a toothpick inserted in the center comes out clean.",
                "Remove the dish from the steamer and let it cool down for a few minutes.",
                "Cut the Bhapa Pitha into pieces and serve warm."
              ],
              "rating": 4.8,
              "favorite": true
            },
            {
              "name": "Mishti Doi",
              "ingredients": [
                "Milk",
                "Plain yogurt",
                "Sugar",
                "Cardamom pods",
                "Saffron (optional)"
              ],
              "method": [
                "In a heavy-bottomed pot, heat the milk over medium-low heat. Stir occasionally to prevent the milk from scorching.",
                "Add the sugar and cardamom pods, and continue to cook the milk until it reduces to half the original quantity. This will take around 30-40 minutes. Remove from heat and let it cool to room temperature.",
                "In a separate bowl, whisk together the plain yogurt and a small amount of the cooled sweetened milk to temper it.",
                "Add the tempered yogurt to the rest of the sweetened milk, and stir well to combine.",
                "Pour the mixture into earthen pots, and cover them with a lid or plastic wrap.",
                "Place the pots in a warm place, like an oven with the light on or in a warm spot in the kitchen. Let the yogurt set for 6-8 hours or until it thickens.",
                "Once the yogurt is set, transfer the pots to the refrigerator to chill for at least 1-2 hours before serving.",
                "If desired, garnish with a few strands of saffron before serving."
              ],
              "rating": 4.2,
              "favorite": false
            }
        ]
    }, 
    {
        "id": 6,
        "name": "Mr. Raju Islam",
        "description": "Chef Mr Raju Islam is a popular Bangladeshi chef who has gained fame for his culinary skills and innovative dishes. he was born in Dhaka, Bangladesh, and started his culinary career in his early twenties. Chef Ali has worked in various renowned restaurants in Bangladesh, including the Pan Pacific Sonargaon Hotel, and has also served as a chef consultant for several international hotels",
        "photo": "https://i.ibb.co/HBdf8DM/image-cheerful-young-cook-uniform-standing-isolated-grey-wall-171337-5340.jpg",
        "like": 1500,
        "years_experience": 12,
        "recipes": [
          {
            "name": "Bhapa pitha",
            "ingredients": [
              "Rice flour",
              "Jaggery",
              "Coconut milk",
              "Water",
              "Salt",
              "Cardamom powder",
              "Shredded coconut (optional)"
            ],
            "method": [
              "In a mixing bowl, combine the rice flour, jaggery, coconut milk, water, salt, and cardamom powder.",
              "Mix the ingredients well to form a smooth batter. The batter should be thick yet pourable.",
              "Grease a shallow heat-proof dish or a steel container with oil.",
              "Pour the batter into the greased dish and sprinkle some shredded coconut on top.",
              "Cover the dish with aluminum foil or a tight-fitting lid.",
              "Place the dish in a steamer and steam for 20-25 minutes or until a toothpick inserted in the center comes out clean.",
              "Remove the dish from the steamer and let it cool down for a few minutes.",
              "Cut the Bhapa Pitha into pieces and serve warm."
            ],
            "rating": 4.8,
            "favorite": true
          },
          {
            "name": "Rui Bhaja",
            "ingredients": [
              "Rohu fish",
              "Turmeric powder",
              "Salt",
              "Mustard oil",
              "Green chilies",
              "Lemon"
            ],
            "method": [
              "Clean and wash the Rohu fish thoroughly.",
              "Marinate the fish with turmeric powder and salt for 15-20 minutes.",
              "Heat mustard oil in a frying pan over medium-high heat.",
              "Add the marinated fish to the hot oil and fry until it becomes golden brown on both sides.",
              "Remove the fish from the pan and place it on a paper towel to absorb excess oil.",
              "Garnish with sliced green chilies and lemon wedges.",
              "Serve hot with steamed rice and dal."
            ],
            "rating": 4.8,
            "favorite": true
          },
            {
              "name": "Bhapa pitha",
              "ingredients": [
                "Rice flour",
                "Jaggery",
                "Coconut milk",
                "Water",
                "Salt",
                "Cardamom powder",
                "Shredded coconut (optional)"
              ],
              "method": [
                "In a mixing bowl, combine the rice flour, jaggery, coconut milk, water, salt, and cardamom powder.",
                "Mix the ingredients well to form a smooth batter. The batter should be thick yet pourable.",
                "Grease a shallow heat-proof dish or a steel container with oil.",
                "Pour the batter into the greased dish and sprinkle some shredded coconut on top.",
                "Cover the dish with aluminum foil or a tight-fitting lid.",
                "Place the dish in a steamer and steam for 20-25 minutes or until a toothpick inserted in the center comes out clean.",
                "Remove the dish from the steamer and let it cool down for a few minutes.",
                "Cut the Bhapa Pitha into pieces and serve warm."
              ],
              "rating": 4.8,
              "favorite": true
            },
            {
              "name": "Mishti Doi",
              "ingredients": [
                "Milk",
                "Plain yogurt",
                "Sugar",
                "Cardamom pods",
                "Saffron (optional)"
              ],
              "method": [
                "In a heavy-bottomed pot, heat the milk over medium-low heat. Stir occasionally to prevent the milk from scorching.",
                "Add the sugar and cardamom pods, and continue to cook the milk until it reduces to half the original quantity. This will take around 30-40 minutes. Remove from heat and let it cool to room temperature.",
                "In a separate bowl, whisk together the plain yogurt and a small amount of the cooled sweetened milk to temper it.",
                "Add the tempered yogurt to the rest of the sweetened milk, and stir well to combine.",
                "Pour the mixture into earthen pots, and cover them with a lid or plastic wrap.",
                "Place the pots in a warm place, like an oven with the light on or in a warm spot in the kitchen. Let the yogurt set for 6-8 hours or until it thickens.",
                "Once the yogurt is set, transfer the pots to the refrigerator to chill for at least 1-2 hours before serving.",
                "If desired, garnish with a few strands of saffron before serving."
              ],
              "rating": 4.2,
              "favorite": false
            }
        ]
    }
]